trainning/101programming/codeStream_INIT/rayleigh_taylor/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 2.55e-03;
    rho             rho [1 -3 0 0 0 0 0] 1.225;
}

phase2
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1.847e-2;
    rho             rho [1 -3 0 0 0 0 0] 0.1694;
}

//sigma           sigma [1 0 -2 0 0 0 0] 0.07;
sigma           sigma [1 0 -2 0 0 0 0] 0.01;

// ************************************************************************* //
