trainning/101programming/codeStream_INIT/rayleigh_taylor/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
   (-0.5 -2 0)
   ( 0.5 -2 0)
   ( 0.5  2 0)
   (-0.5  2 0)
   (-0.5 -2 0.1)
   ( 0.5 -2 0.1)
   ( 0.5  2 0.1)
   (-0.5  2 0.1)
);

blocks          
(
      hex (0 1 2 3 4 5 6 7) (32 128 1) simpleGrading (1 1 1)
    //hex (0 1 2 3 4 5 6 7) (64 256 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    symmetryPlane top
    (
        (0 1 5 4)
    )
    symmetryPlane bottom 
    (
        (3 7 6 2)
    )
    symmetryPlane left
    (
        (3 0 4 7)
    )
    symmetryPlane right 
    (
        (2 6 5 1)
    )
    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
